"""
5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом
работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите
соответствующее сообщение. Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение
прибыли к выручке). Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на
одного сотрудника.
"""

revenue = int(input('Выручка: '))
costs = int(input('Издержки: '))

result = revenue - costs

if result > 0:
    print('Компания работает с прибылью:', result)
    print('Рентабельность:', result / revenue)
    people = int(input('Численность сотрудников: '))
    print(f'Прибыль на одного сотрудника: {result / people:.2f}')
else:
    print('Компания работает с убытком!')
